app/controllers/alleles_controller.rb

SELECT "alleles".* FROM "alleles"
---
  def index
    alleles = Allele.all

INSERT INTO "alleles" ("name", "chromosome_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "kk"], ["chromosome_id", 1], ["created_at", "2023-12-12 00:52:23.854766"], ["updated_at", "2023-12-12 00:52:23.854766"]]
---
  def create
    @allele = Allele.new(allele_params)

    if @allele.save

SELECT "alleles".* FROM "alleles" WHERE "alleles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_allele
    @allele = Allele.find(params[:id])