app/controllers/chromosomes_controller.rb

SELECT "chromosomes".* FROM "chromosomes"
---
  def index
    @chromosomes = Chromosome.all

INSERT INTO "chromosomes" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "TG"], ["created_at", "2023-12-12 00:14:58.010793"], ["updated_at", "2023-12-12 00:14:58.010793"]]
---
  def create
    @chromosome = Chromosome.new(chromosome_params)

    if @chromosome.save

SELECT "chromosomes".* FROM "chromosomes" WHERE "chromosomes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_chromosome
    @chromosome = Chromosome.find(params[:id])